tap "cloudflare/cloudflare"
tap "superfly/tap"
tap "depot/tap"

# Terminal
brew "tmux"
cask  "iterm2", args: { appdir: "/Applications"}
brew "zsh"
brew "reattach-to-user-namespace"
brew "neovim"
brew "wget"
brew "mas"

# Databases
brew "postgresql@14"
brew "mysql"

# Languages
brew "node"
brew "deno"
brew "nodenv"
brew "yarn"
brew "rbenv"
brew "watchman"
brew "pyenv-virtualenv"
brew "go"
brew "rust"
brew "oven-sh/bun/bun"

# CLI
brew "flyctl"
brew "gh"
brew "awscli"
brew "aws-iam-authenticator"
brew "gpg2"
brew "cloudflared"
brew "asc"
brew "depot/tap/depot"
cask "1password-cli"

# Kube
cask "lens", args: { appdir: "/Applications" }

# Devtools
cask "macvim-app", args: { appdir: "/Applications"}
cask "docker-desktop", args: { appdir: "/Applications"}
cask "raycast", args: { appdir: "/Applications" }
cask "linear-linear", args: { appdir: "/Applications" }
cask "cleanshot", args: { appdir: "/Applications" }
cask "ngrok", args: { appdir: "/Applications" }
cask "bruno", args: { appdir: "/Applications" }

# Knowledge/Communications
cask  "slack", args: { appdir: "/Applications"}
cask  "notion", args: { appdir: "/Applications"}
cask  "zoom", args: { appdir: "/Applications"}
cask  "tableplus", args: { appdir: "/Applications"}
cask  "rapidapi", args: { appdir: "/Applications"}
cask  "loom", args: { appdir: "/Applications"}
cask  "obsidian", args: { appdir: "/Applications"}
cask  "notion-calendar", args: { appdir: "/Applications"}

# Misc
cask "spotify", args: { appdir: "/Applications"}
cask "google-chrome", args: { appdir: "/Applications"}
cask "google-drive", args: { appdir: "/Applications"}
cask "visual-studio-code", args: { appdir: "/Applications"}
cask "cursor", args: { appdir: "/Applications"}
cask "1password", args: { appdir: "/Applications"}
cask "bambu-studio", args: { appdir: "/Applications"}
cask "tailscale-app", args: { appdir: "/Applications"}
cask "granola", args: { appdir: "/Applications"}
cask "superwhisper", args: { appdir: "/Applications"}

# Mac app store
mas 'Xcode', id: 497_799_835
mas 'Paste', id: 967_805_235
mas 'SimpleNote', id: 692_867_256
