tap "homebrew/cask"

# Terminal
brew "tmux"
cask  "iterm2", args: { appdir: "/Applications"}
brew "zsh"
brew "reattach-to-user-namespace"

# Databases
brew "postgres"

# Languages
brew "node"
brew "nodenv"
brew "rbenv"
brew "watchman"
brew "pyenv-virtualenv"

# ClI
brew "mitmproxy"
brew "terraform"
brew "awscli"
brew "aws-iam-authenticator"
brew "gpg2"

# Kube
cask "lens", args: { appdir: "/Applications" }

# Devtools
cask  "macvim", args: { appdir: "/Applications"}
cask  "virtualbox", args: { appdir: "/Applications"}
cask  "graphiql", args: { appdir: "/Applications"}

# Knowledge/Communications
cask  "slack", args: { appdir: "/Applications"}
cask  "notion", args: { appdir: "/Applications"}

# Misc
cask "spotify", args: { appdir: "/Applications"}
cask "google-chrome", args: { appdir: "/Applications"}
cask "istat-menus"
